Undefined temperature unit: '[Temperature Unit Type Name]'
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId UndefinedTemperatureUnit { get; }
  Visual Basic
Public Shared ReadOnly Property UndefinedTemperatureUnit As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ UndefinedTemperatureUnit {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures ConversionFailures Class
  Autodesk.Revit.DB Namespace